import random
import pytz
from datetime import date, time, datetime, timedelta

from django.conf import settings
from django.utils import timezone

from students.models import Student, Attendance, Inbody


# Please uncomment `korean_name_generator` in settings.INSTALLED_APPS
# The student database should be empty

"""
Student
"""
TODAY_DATE = date(2023, 7, 25) # for age calculation
BIRTH_START_DATE = date(2010, 1, 1)
BIRTH_END_DATE = date(2016, 12, 31)

NUM_STUDENT = 30
MAX_GRADE = 6 
MAX_ROOM = 10
MAX_NUMBER = 30

"""
Attendance
"""
ATTENDANCE_START_DATE = date(2022, 7, 26)
ATTENDANCE_END_DATE = date(2023, 7, 25)

"""
Inbody
"""
INBODY_START_DATE = date(2022, 7, 26)
INBODY_END_DATE = date(2023, 7, 25)
MIN_INBODY_TERM = 3
MAX_INBODY_TERM = 10


class GenerateStudentDummyData():
    MALE_NAMES = ['구혀연', '양면용', '전벙준', '오희원', '민주하', '이호지', '박대석', '이제지', '이미운', '박미연', '김지하', '황승하', '김성기', '정원중', '김동주', '김주준', '김윤하', '손영하', '강채원', '김혀원', '여주하', '심혀준', '이동우', '박창요', '김전운', '유원성', '유주완', '황승연', '김용윤', '유지도', '박정구', '송겅연', '신광하', '장지하', '이지재', '김지규', '김시규', '유재주', '양상기', '김대하', '이지윤', '이겅수', '박대석', '안장요', '이혀하', '이성석', '정창규', '이성지', '나원지', '이혀우', '조대완', '박지비', '박화비', '배이미', '정태하', '박영하', '이미하', '곽응조', '민찬하', '조이성', '홍영하', '이성기', '김상하', '이창석', '김경청', '박하미', '신종우', '이태원', '문혀하', '민성규', '한원성', '모승운', '전기미', '강이하', '유지하', '김희하', '양중준', '신연성', '유유래', '강용미', '김대운', '김공비', '김견하', '이대하', '이병운', '조희운', '신의유', '이군성', '신조하', '하재견', '이창준', '김승건', '송지하', '임재하', '황성력', '이준준', '윤은하', '이원운', '이창석', '이유준', '이병운', '유용영', '박주론', '박승송', '박호준', '조효이', '전가번', '박라운', '김지전', '박성하', '채동준', '함미수', '이주하', '이동용', '채재연', '염주원', '문승하', '최영석', '장유재', '임동태', '구재이', '성혀재', '최병하', '이세승', '이태피', '전해수', '안벙우', '박동하', '심수연', '임해준', '김희주', '송성미', '홍윤재', '한기하', '이우승', '정동규', '이윤하', '이미평', '정우주', '임승하', '이조하', '김주운', '배성하', '김경수', '임동비', '오동역', '이미준', '정응하', '정겅석', '서재시', '김굥원', '조해성', '허혀주', '박하재', '박경미', '박재푱', '박기하', '김정연', '정호윤', '이지수', '임영지', '윤우하', '노예준', '진동성', '정운준', '정희성', '김세과', '정재연', '곽성윤', '배미주', '정성성', '김성운', '송병운', '문미하', '정성용', '여영구', '최세조', '최지균', '조강운', '박동제', '이찬연', '양유재', '우준엉', '김대시', '남하하', '한주석', '곽영규', '김준우', '이동근', '손병던', '박우규', '김선주', '우숭석', '진대성', '임윤수', '조준균', '성규하', '김태준', '정지하', '박성하', '정혀하', '최혀규', '강세피', '박정하', '서정원', '최지도', '조지하', '송정재', '최정연', '남재표', '임재덩', '김능태', '이주운', '김산하', '채거윤', '박응운', '홍동재', '신승하', '김미하', '한군걸', '전희운', '김성하', '임연제', '최병하', '이동하', '강휘제', '권윤변', '강재우', '한지주', '서연성', '윤운연', '이동시', '이혀준', '임정하', '강창미', '박경미', '임관우', '장혀하', '홍재미', '김도준', '채이성', '채규준', '이준균', '노동영', '최하하', '이간승', '양승하', '홍동용', '박수덩', '이이미', '이성색', '한성미', '김윤하', '민동이', '박정석', '김성미', '전동석', '박종연', '최동분', '황지푱', '문지하', '박영하', '박병우', '장전하', '홍경면', '이권하', '장유하', '김혀하', '김태지', '김승원', '변숭하', '박태영', '김태미', '김미재', '권태연', '우지찬', '김병몬', '김시하', '채벙석', '김지새', '최상하', '이동이', '김송건', '최상규', '이효하', '이저기', '김운사', '최동찬', '박하찬', '유호견', '송준석', '윤지석', '김성미', '김영연', '김윤하', '김동승', '유재시', '최화하', '이견운', '김겅원', '이미연', '신동하', '김준번', '김연지', '임창하', '남정수', '김태영', '이상하', '전성운', '박재하', '이운비', '박미준', '유창석', '안혀하', '문성준', '김태수', '나상찬', '박수하', '이정우', '이승기', '유재우', '김영태', '최준오', '윤주원', '하준준', '신성군', '김태우', '이준연', '전준재', '정조균', '서재변', '김우찬', '양윤하', '박전하', '신동하', '진면미', '안경영', '원동유', '이숭영', '서미미', '주조당', '강승재', '임종영', '박혀하', '권경석', '옥미하', '강이영', '김은규', '권종문', '김지하', '이병성', '고정하', '정원하', '김성주', '윤성하', '손낭하', '안기우', '송연하', '백상규', '김규하', '송영슨', '하면하', '박유하', '최지우', '황광몽', '성지준', '오정미', '이하운', '김준시', '김경하', '이창준', '신성석', '박태지', '김승우', '오긍하', '조하준', '백성하', '김재석', '배혀선', '오문운', '허원준', '김혀수', '박미하', '강요하', '남재석', '권성원', '이병원', '강균하', '이재균', '이지하', '정대준', '임동준', '박춘우', '이성수', '김성연', '서지타', '김원찬', '조혀하', '장사하', '이주견', '김찬하', '김혀석', '곽동련', '조태주', '홍동운', '이재하', '우태조', '최전문', '박희하', '김미하', '정동운', '손성석', '박혀피', '김원하', '최경유', '임성지', '임승수', '김재영', '강미원', '홍도하', '성수지', '박희하', '김광보', '이의미', '여미성', '김순제', '이우성', '임지천', '이동하', '노주하', '김재하', '윤산하', '최도정', '윤춘미', '오연하', '송병하', '신성준', '정태요', '조혀균', '박영하', '송혀하', '박상석', '이혀하', '김주원', '권동하', '김수하', '이청재', '임슨석', '김재하', '이우미', '김주지', '구종이', '차희원', '홍동준', '박승하', '이종하', '심세미', '이조하', '오재재', '윤긍웅', '김지미', '이재성', '김이영', '이동태', '서혀전', '조성하', '김재기', '김세성', '김상하', '박동석', '정성하', '장광숭', '허지용', '방동태', '조태하', '박중하', '정성원', '박호기', '이원하', '김원수', '노혀이', '강예우', '오승서', '한나시', '엄운하', '정주하', '박송하', '김혀하', '김수용', '배성규', '유동하', '하정성', '김동연', '김청하', '정미하', '소유섭', '강지하', '문운하', '이의하', '정종윤', '전윤석', '남창서', '김승하', '문승당', '박지전', '함찬하', '박성하', '김혀조', '민상지', '황혀하', '이허원', '이지재', '김면운', '권재석', '배경하', '조성비', '권혀하', '김주준', '김상석', '이혀원', '김태연', '서태운', '이태운', '차호수', '김상수', '정찬수', '박이수', '김제하', '김도규', '김상미', '하숭성', '김동하', '조유원', '전성유', '주미하', '박희원', '윤주수', '김제하', '박재준', '이동운', '정재연', '이성성', '박병하', '문미비', '조호석', '강운수', '박희태', '김영하', '이응미', '위준엽', '김준운', '하재성', '전응고', '임성석', '박강하', '조문하', '김정표', '박태번', '오봉우', '박규균', '문미미', '김주우', '김병귤', '차미류', '김혀미', '곽재숙', '백세하', '김하피', '윤재하', '손태하', '지정준', '홍지연', '서봉석', '김규미', '권성연', '정시미', '김수하', '윤정운', '김승오', '이호하', '최영도', '곽동준', '이상원', '지성모', '나경하', '양관재', '임면번', '이태건', '정혀청', '김지기', '김주석', '이지하', '염순윤', '권미하', '김기지', '김이리', '박조성', '이이석', '유미준', '김대리', '유세운', '김성원', '김겅하', '김창하', '이태준', '김우이', '서제수', '정기준', '신제하', '오혀규', '임정하', '강연준', '이혀우', '고연하', '이숭유', '박창운', '김견태', '고성규', '박숭문', '우호지', '박재연', '안하관', '유후규', '박혀하', '임종재', '김종삭', '정전재', '김정우', '김성규', '정운운', '임승하', '한상하', '김주하', '한혀번', '김효비', '이주준', '이호하', '김주유', '박재하', '이태산', '최동하', '임승시', '박순관', '김재견', '조재주', '김연요', '장성하', '김상연', '김건석', '이시하', '지종하', '윤의배', '김견하', '정태우', '윤겅준', '손기주', '안요하', '안지준', '신태요', '김미규', '김상용', '최견이', '임원모', '이주이', '심용로', '정균미', '권동하', '안태철', '노영타', '정희하', '김기균', '주지수', '김화연', '김지운', '노경준', '이상수', '최혀하', '이윤억', '김희운', '서연욱', '김창운', '유미지', '정겅준', '박성연', '김혀하', '임응하', '이희간', '양상석', '신성응', '임성하', '김영욱', '김재하', '심시성', '정승지', '서우소', '주응찬', '임도전', '이창하', '권상규', '이성미', '신지기', '엄성태', '김재운', '김혀우', '이기연', '이휘찬', '권재하', '노재운', '정운도', '김혀기', '송원하', '최명문', '강도역', '임요하', '문주지', '최성용', '김재연', '고미하', '강면미', '김기수', '이미윤', '길존균', '김지주', '정미준', '박승운', '이수하', '권운하', '박호고', '한영숙', '위치하', '문승하', '김미석', '조운하', '이서천', '소경하', '김예요', '강종하', '주겅하', '박시하', '김재하', '최재하', '김도원', '홍종하', '김전완', '오도미', '윤미미', '박관숙', '염찬준', '김상하', '신동덩', '이도섭', '이영하', '이윤하', '한규운', '김당준', '오호하', '이성주', '이도하', '정상하', '김시승', '강숭준', '김동겅', '김재재', '윤창하', '이영성', '김운하', '하재하', '박기하', '이주이', '홍하비', '임지영', '유상연', '남성우', '김태천', '홍혀연', '김태요', '이미운', '안유영', '정지하', '김운하', '이성준', '문재우', '백원영', '김우원', '김정준', '박정성', '진성기', '김동두', '박영원', '김수요', '이혀준', '이제준', '박하승', '김동철', '김주재', '오혀준', '장석기', '김정성', '장승연', '김수하', '이미하', '이원미', '박희규', '전혀동', '김상하', '강효하', '김재간', '이하하', '임찬영', '이재원', '고주하', '유지지', '최원년', '장재석', '최병소', '전창태', '최세석', '최대하', '김혀시', '신주하', '이주원', '조승하', '장요시', '윤태성', '전영미', '유준윤', '조기하', '박영운', '백순하', '김지찬', '노승양', '배덩비', '권준선', '정찬지', '황후균', '고동재', '정강수', '남경준', '이천규', '정동근', '문상원', '송전운', '이지우', '한준운', '정재미', '한동준', '유태태', '김이지', '김광근', '백강근', '함미찬', '김선준', '김지태', '한원하', '김용기', '이운지', '이균선', '박지우', '이구하', '배운우', '권성하', '김영태', '김동하', '정영하', '이완우', '유승이', '강도하', '정재원', '최문섭', '우허하', '나준하', '박태엉', '신응구', '이원하', '홍경하', '정화우', '정광하', '조호재', '이혀용', '장성하', '한유주', '임미하', '장벙원', '심주하', '홍주석', '엄재석', '김상규', '김경이', '김정전', '이지원', '정승영', '최승석', '함조덩', '박성이', '이혀연', '이희하', '박호하', '전경재', '이성문', '강병영', '방대푱', '김도석', '유대미', '김재얼', '윤재주', '김주지', '하관태', '김태우', '이경하', '우호하', '김승원', '권대은', '최미주', '최준수', '김지우', '양화성', '백승하', '김연완', '김승석', '김동전', '김성웅', '김호찬', '정창운', '정주이', '박사리', '류승하', '이혜운', '김겅석', '김종변', '신긍균', '신혀이', '이미준', '한재철', '윤승운', '송하균', '최동기', '이효석', '이병비', '이정찬', '신지시', '김지하', '채재균', '임재주', '문하비', '김원준', '이동지', '정주석', '장찬하', '이태성', '김혀하', '윤태표', '조지숙', '김시수', '손재윤', '강기미', '이몽하', '윤운원', '석견하', '유상하', '이영규', '강저재', '차견이', '유창재', '정승석', '홍준하', '류하석', '양성규', '박주규', '이영균', '박성영', '김호하', '김준하', '민미하', '김수하', '안승하', '김희역', '정재연', '김도하', '이재하', '박채성', '정군조', '김경우', '곽대하', '김효하', '김규하', '문찬우', '정효균', '조온하', '김상주', '구승하', '조승재', '김용수', '이혀하', '신준하', '박미룡', '김혀하', '김재남', '김지하', '이태이', '박태하']
    FEMALE_NAMES = ['정은미', '서서저', '정지원', '김미저', '김미서', '박서영', '한미비', '최주지', '김수서', '이소저', '김하은', '이하지', '양하지', '조보비', '이수윤', '원유미', '나다비', '김하비', '조수양', '현도수', '장서미', '장시지', '강예지', '도연연', '한저서', '이하지', '이하하', '박수은', '김주운', '신주원', '이다예', '유하주', '김소연', '문성주', '이수원', '안유양', '이도하', '최승이', '이서우', '박가이', '오미저', '김미지', '이원슨', '심유하', '서지윤', '최저은', '이하은', '정미연', '원수연', '오서은', '고지비', '신예연', '방규리', '손저지', '양은지', '염은지', '정하경', '김세지', '한하리', '김은하', '안서전', '김가저', '김은비', '이하선', '정지른', '강승연', '이수서', '서미하', '설미원', '김시이', '최여하', '서수저', '이유윤', '전지하', '노나원', '조소영', '홍하연', '최수연', '이예지', '박문미', '장하연', '배지나', '정보아', '김수솔', '이시주', '장주연', '이세준', '김소지', '김예연', '최유하', '김슨은', '권하지', '양아미', '한재지', '안미하', '김최원', '박다하', '노소연', '윤미영', '제채서', '김세원', '여지지', '유아이', '박윤우', '노여운', '노은은', '이수연', '김미비', '현가하', '노수경', '손연우', '이소윤', '전지영', '주은지', '강미주', '박다미', '안하수', '윤은하', '최지선', '연하리', '한연지', '전주연', '김소연', '김지시', '유하은', '백아수', '김은은', '김하원', '이하미', '이은원', '정유하', '김하은', '김하미', '이수지', '김태우', '김가하', '이하연', '김지리', '김서연', '강미원', '최미경', '방수은', '정도리', '신채원', '강예지', '김서미', '이미하', '심미정', '천지이', '송소정', '이시윤', '이하원', '문지하', '신저윤', '고예비', '김시미', '박안이', '장무라', '홍유람', '김주원', '박지연', '김예지', '윤윤비', '서유리', '이소하', '서서하', '석미지', '전수윤', '송소리', '김유안', '장세비', '성주하', '최보연', '강하소', '김세하', '허재원', '신세연', '김지연', '유자기', '배최하', '이저른', '김사경', '김벼언', '강유연', '조시른', '김유솔', '정은원', '설다윤', '이서지', '송지서', '심태하', '신연지', '정서이', '유서하', '윤수하', '곽지영', '정하연', '권시은', '김연미', '임승연', '한미연', '김예하', '이유저', '신하미', '공사경', '배유우', '주지연', '김세하', '최재수', '김태연', '강미하', '박수연', '문승연', '정지하', '고세하', '안하저', '김주지', '한하시', '박승윤', '이미연', '임은미', '이미경', '김나견', '정보원', '이하지', '곽미은', '황미미', '황은련', '박지연', '이하영', '이하윤', '박미하', '정승하', '임도은', '심고연', '이지미', '정슨하', '박규경', '지예지', '장유이', '김하지', '김지저', '이성경', '정미우', '윤지미', '이주연', '박하지', '공서원', '김태전', '홍예선', '조세정', '김미미', '오다연', '기긍하', '최윤경', '윤슨미', '양송연', '장나연', '박서저', '오수저', '이연하', '이보앙', '최수비', '김보하', '김다지', '김채리', '이이서', '김미수', '박지연', '신지하', '석미저', '김나하', '류소서', '이유저', '이성경', '장태경', '김시경', '권연하', '박가저', '김하연', '박나원', '장미래', '송세주', '하다저', '유보지', '차예하', '최은원', '한예애', '고규하', '손하서', '이하미', '김지은', '이미이', '이무원', '송소미', '박나연', '김이지', '우승윤', '오하은', '홍하비', '소채원', '우도하', '김유수', '최가안', '지수리', '이하비', '이소은', '조하윤', '강미미', '이응라', '최소연', '박수이', '이미서', '전유연', '김승비', '박소하', '장하하', '강하비', '이미지', '윤예경', '임보지', '강서은', '강다하', '변시지', '권유지', '주지도', '유가연', '신서하', '김성윤', '심서하', '이소하', '정은주', '배여연', '정서윤', '이수서', '이미미', '강다연', '김미원', '선태우', '박보비', '김예지', '김하지', '신하비', '조근비', '박소우', '박예이', '박오경', '박지은', '최지윤', '박소비', '조은하', '최보리', '이다은', '이세하', '김유서', '박서영', '원다연', '김은이', '김은안', '김이예', '박도하', '김하지', '정연지', '윤세수', '박미지', '김서연', '장세늘', '한은연', '전채미', '정하윤', '이유준', '홍예지', '이예원', '김하수', '최윤연', '이세연', '김예경', '김세은', '김하솔', '김보안', '최하경', '이수은', '이서기', '김다지', '백주하', '강서리', '양유이', '신나운', '양지주', '김미련', '이어은', '최서지', '김지연', '이수연', '이다연', '유유경', '김도미', '김수은', '최수수', '성저미', '최시경', '강소비', '이유영', '정저저', '정윤지', '박하경', '박지미', '유저솔', '김하비', '정이안', '이유전', '김지주', '정미연', '김은미', '박시영', '김윤은', '박지미', '조예영', '윤보하', '조세하', '최수저', '한윤하', '염가이', '정다연', '박가지', '주미연', '양하하', '김유연', '제소하', '유보원', '안서연', '이승연', '김서어', '전오원', '정유지', '강나미', '이미윤', '노수하', '오소지', '박은솔', '이규하', '서수지', '김소연', '윤유정', '김시은', '한수비', '이연미', '이사경', '박윤미', '이소지', '김하경', '이지하', '최소하', '최지비', '한도주', '조수연', '신연저', '김시은', '윤다하', '조하하', '김수리', '김유하', '신하은', '김소윤', '강주지', '김나연', '민서연', '박유연', '황지경', '유유지', '고지연', '김근영', '이미이', '추유은', '이예윤', '강슨은', '김수연', '이자영', '설주라', '정유안', '김시연', '이아미', '강수연', '임은라', '함조은', '엄주련', '황하원', '박지비', '허나아', '김소영', '김지아', '전시은', '허하미', '김사비', '양서연', '이하원', '송최연', '김예리', '김지늘', '배세련', '최원영', '윤세주', '오지하', '이소애', '조서하', '안자운', '이하비', '김지하', '김유미', '이하원', '박하주', '박가지', '강미원', '이태리', '김지지', '노주지', '왕예지', '조채은', '김어지', '김수예', '정유하', '김지윤', '김하연', '이태은', '이이연', '김미리', '김미하', '한채미', '김하은', '최유경', '이채하', '정언원', '박은하', '서태우', '김하연', '이시이', '허새하', '강서하', '고다비', '성유연', '최지하', '김은수', '백은원', '정미주', '김은저', '김하다', '박승서', '정서연', '손수연', '탁서원', '최재지', '박병라', '이태저', '이하주', '이하이', '윤연리', '윤서저', '추성경', '이다연', '김수서', '박하하', '서수하', '김지전', '김의비', '곽유서', '신미나', '임수은', '양예연', '김지미', '윤소연', '정하연', '이지서', '박지주', '손미비', '김하나', '유주지', '박이하', '이서윤', '허연연', '황미지', '이주나', '고수하', '오주연', '이무미', '박하연', '김저경', '최하시', '오유은', '유다지', '송채미', '임예은', '강연비', '신수영', '이예이', '유소서', '정하은', '이가리', '김수이', '손하미', '한수연', '류지솔', '박지운', '최성지', '김지은', '허하주', '박유지', '진지경', '김세경', '이도연', '배원연', '이이경', '최오이', '정하주', '권하연', '김유연', '장수우', '박소미', '김예연', '최지영', '안저미', '심지연', '최연하', '채시서', '이윤은', '홍윤원', '문가비', '오하하', '서나지', '이저미', '천가서', '김연연', '주하미', '손은서', '강다이', '이다나', '한유윤', '김윤연', '박수리', '박유이', '이미연', '김은원', '남다서', '강하연', '김예윤', '박지은', '장예이', '황수원', '이지원', '최소서', '박소비', '김수서', '지다은', '강연경', '송나지', '안성비', '조주미', '홍다하', '박예원', '이하지', '한유하', '김미지', '김예경', '김주지', '김하아', '이소연', '강아채', '임하은', '김서서', '김수하', '홍시연', '박승연', '박유지', '방승지', '나지하', '김예저', '김규하', '최하예', '우시미', '양은연', '정세라', '차예주', '전예연', '김세운', '장하지', '마미저', '김보연', '이채지', '염미이', '최가원', '강미은', '김수비', '심채원', '김주지', '박소하', '신하미', '심지연', '강예연', '김규원', '이유예', '김하영', '이예재', '현주서', '한자하', '김사주', '곽주원', '김수영', '홍하연', '황채안', '정서비', '조아하', '이윤하', '신미시', '권하주', '김은연', '엄나원', '박수연', '김수하', '정유련', '박나미', '안하리', '김아연', '김연지', '박하원', '박하리', '윤지원', '한미연', '김서연', '왕지원', '한하미', '전예원', '임연하', '임소연', '김하하', '박보솔', '이수연', '이가서', '김보연', '김소서', '최서저', '신하지', '조서연', '김유하', '장서비', '이유원', '김하원', '이보경', '이지지', '양시영', '박가주', '김지연', '이수리', '박도하', '고저서', '박소미', '김하원', '유고주', '조지서', '이하하', '홍유연', '김세지', '김저경', '강서연', '조소미', '안지연', '정미지', '이초영', '이하이', '전서은', '윤수수', '박시경', '박보아', '박미하', '정유우', '임수지', '하주경', '고저하', '최승하', '권하서', '김저안', '우미윤', '조수지', '신서애', '최가하', '최다연', '김저영', '박유비', '김미연', '김주서', '서시연', '박다지', '전하예', '김예지', '김수서', '전유연', '박초재', '오서미', '곽지원', '이은지', '권지서', '김주라', '이유미', '안저은', '하미지', '김하지', '박하은', '오주이', '임은하', '김서하', '석미서', '유승원', '김자예', '함서주', '곽예하', '신무연', '이수경', '김유지', '손하연', '구가연', '임소전', '박미연', '박다수', '차은연', '이세나', '이지지', '정세시', '박소지', '강소서', '안미연', '최지하', '권지리', '김보하', '고하아', '이유은', '정하연', '김미리', '김다하', '오지지', '문성연', '이서하', '윤미연', '명미지', '이수하', '박수지', '최연전', '오유비', '이하하', '김가연', '허지지', '김미지', '이나원', '이보연', '고지리', '이지리', '김예원', '이가예', '채하래', '김아연', '유지이', '정예연', '장서하', '양지저', '이서원', '이지서', '임세연', '김예하', '김미하', '박수연', '이미원', '이재영', '이유경', '이지서', '백하리', '박지서', '임하영', '신유원', '하저연', '박나리', '이서주', '한하은', '신유은', '최기리', '정윤소', '김수은', '김아지', '백승연', '정유연', '임다지', '김소연', '양슨예', '김세영', '장하전', '이수비', '권시하', '류은경', '이지지', '이시경', '이유연', '유주미', '나지연', '오하지', '진도지', '손지연', '서유은', '방하원', '조수은', '김윤원', '오수서', '박미원', '김아원', '김세수', '백미나', '정연원', '강하서', '송조연', '이규운', '권채어', '김서지', '함지연', '황지지', '채하원', '신지미', '이성원', '윤유지', '이세지', '강은비', '장하은', '김주예', '이하연', '곽미하', '이견하', '정저연', '김하비', '이미아', '이하리', '유나수', '임미미', '김예지', '이지주', '서재정', '조세윤', '이승하', '이윤예', '김세하', '심지은', '편지주', '심윤은', '박채시', '최지솔', '김보하', '신다연', '안지저', '양수연', '최지은', '이성저', '김예지', '김지이', '박유하', '장은서', '오유지', '고서지', '서성안', '임지리', '최은지', '이다미', '김하윤', '장지원', '박미비', '박하서', '강예나', '김미비', '염지은', '김저지', '이지하', '정하리', '신서서', '이서연', '김도원', '서미미', '임지은', '이유이', '구수은', '김주연', '서성애', '이서연', '정다원', '손하미', '현보지', '이수지', '윤다지', '최수서', '소주연', '이서지', '이하지', '박사서', '이하연', '윤미지', '김다하', '이미지', '정수원', '임송연']

    def __init__(self, today_date, birth_start_date, birth_end_date, num_student, max_grade, max_room, max_number, attendance_start_date, attendance_end_date, inbody_start_date, inbody_end_date, min_inbody_term, max_inbody_term):
        self.today_date = today_date
        self.birth_start_date = birth_start_date
        self.birth_end_date = birth_end_date
        self.birth_num_days = (birth_end_date - birth_start_date).days

        self.num_student = num_student
        self.max_grade = max_grade
        self.max_room = max_room
        self.max_number = max_number

        self.attendance_start_date = attendance_start_date 
        self.attendance_end_date = attendance_end_date 
        self.attendance_num_days = (attendance_end_date  - attendance_start_date).days

        self.inbody_start_date = inbody_start_date
        self.inbody_end_date = inbody_end_date
        self.min_inbody_term = min_inbody_term
        self.max_inbody_term = max_inbody_term

    # Generate attendance
    def generate_attendance(self, student_id):
        for i in range(self.attendance_num_days + 1):
            attendance_date = self.attendance_start_date + timedelta(days=i)

            # If it's weekend apss
            if attendance_date.weekday() in (5, 6):
                continue

            # Possibility of duplicated attendance_check
            p = random.uniform(0, 1)
            num_attendance = 1
            if p < 0.02:
                num_attendance = 3
            elif p < 0.1:
                num_attendance = 2

            attendance_start_datetime = datetime.combine(attendance_date, time(9, 0, 0))
            attendance_end_datetime = datetime.combine(attendance_date, time(13, 0, 0))
            time_delta = attendance_end_datetime - attendance_start_datetime
            random_seconds = random.randint(0, int(time_delta.total_seconds()))

            tz = pytz.timezone(settings.TIME_ZONE)
            date_attended = attendance_start_datetime + timedelta(seconds=random_seconds)
            date_attended = timezone.make_aware(date_attended, timezone=tz)

            for _ in range(num_attendance):
                # print('date', date_attended)
                attendance = Attendance.objects.create(student_id=student_id, date_attended=date_attended)
                attendance.save()
                random_seconds = random.randint(35 * 60, 120 * 60)
                date_attended += timedelta(seconds=random_seconds)

    # Generrate inbody
    def generate_inbody(self, student_id, birth_date):
        test_date = self.inbody_start_date

        while test_date < self.inbody_end_date:
            test_date +=  timedelta(days=random.randint(self.min_inbody_term, self.max_inbody_term))

            height = random.uniform(120, 190)
            weight = random.uniform(40, 80)
            age = (test_date - birth_date).days // 365

            total_body_water = random.uniform(10, 20)
            protein = random.uniform(5, 15)
            minerals = random.uniform(2, 5)

            skeletal_muscle_mass = random.uniform (20, 40)
            body_fat_mass = random.uniform(5, 20)

            body_mass_index = random.uniform(15, 25)
            percent_body_fat = random.uniform(5, 30)
            score = random.randint(1, 100)

            inbody = Inbody.objects.create(student_id=student_id, test_date=test_date, 
                                        height=height, weight=weight, age=age,
                                        total_body_water=total_body_water, protein=protein, minerals=minerals, 
                                        skeletal_muscle_mass=skeletal_muscle_mass, body_fat_mass=body_fat_mass,
                                        body_mass_index=body_mass_index, percent_body_fat=percent_body_fat, score=score)
            inbody.save()
        
    def generate_dummpy_date(self):
        """
        Generate students based on {grade, room, number} since there's a unique constraint
        After generate student, Genertae attendnace & inbody with the student's instance pk
        """

        # Genreate Student based on {grade, room, number}
        grade, room, number = 1, 1, 0
        for _ in range(self.num_student):
            number += 1
            if number == self.max_number + 1:
                number = 1
                room += 1
            if room == self.max_room + 1:
                room = 1
                grade += 1

            sex = random.choice([1, 2])
            name = random.choice(GenerateStudentDummyData.MALE_NAMES) if sex == 1 else random.choice(GenerateStudentDummyData.FEMALE_NAMES)

            random_num_days = random.randint(0, self.birth_num_days)
            birth_date_date = self.birth_start_date + timedelta(days=random_num_days)
            birth_date = birth_date_date.strftime('%Y-%m-%d')

            student = Student.objects.create(grade=grade, room=room, number=number, name=name, sex=sex, birth_date=birth_date)
            student.save()
            student_id = student.pk

            self.generate_attendance(student_id)
            self.generate_inbody(student_id, birth_date_date)

def generateStudentDummyData():
    GenerateStudentDummyData(today_date=TODAY_DATE, birth_start_date=BIRTH_START_DATE, birth_end_date=BIRTH_END_DATE, 
                            num_student=NUM_STUDENT, max_grade=MAX_GRADE, max_room=MAX_ROOM, max_number=MAX_NUMBER, 
                            attendance_start_date=ATTENDANCE_START_DATE, attendance_end_date=ATTENDANCE_END_DATE, 
                            inbody_start_date=INBODY_START_DATE, inbody_end_date=INBODY_END_DATE, min_inbody_term=MIN_INBODY_TERM, max_inbody_term=MAX_INBODY_TERM).generate_dummpy_date()